using System.Diagnostics.CodeAnalysis;

namespace naiden_gerov_zadachi
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /////////////////////////////////////////////////////////////////////////////////
            // Primer 0 - Описание за коментари
            // За да коментираме един ред в кода използваме две наклонени черти надясно: //
            // Така кода се закоментира от първото тяхно срещщане

            // За да закоментираме част от ред или много редове използваме: /* */ 
            // Пример:
            Console/* Тук има коментар с който кода пак се компилира(стартира) */.WriteLine();

            /* Тук имаме коментари
             на повече от 
             един ред
            */

            /////////////////////////////////////////////////////////////////////////////////
            // Primer 1 - Дефииниране на double променлива и принтиране на конзолата

            // Променлива се дефенира по следния начин
            // [тип на променливата] [име на променливата] = [начална стойност];
            // Пример:
            // int num = 0;
            double number = 5.5;

            // Създадената променлива с отпечатва на конзолата по следния начин:
            Console.WriteLine(number /* Тук се пише БЕЗ кавички името на променливата */);

            /////////////////////////////////////////////////////////////////////////////////
            // Primer 2 - Дефииниране на string променлива и принтиране на конзолата
            // Подобно на горния пример имаме отново:
            // [тип на променливата] [име на променливата] = [начална стойност];

            // Когато използваме string(текст) стойноста се записва в двойни кавички
            string name = "az sum ot naiden gerow";
            Console.WriteLine(name /* Тук отново се пише БЕЗ кавички името на променливата */);

            /////////////////////////////////////////////////////////////////////////////////
            // Primer 3 - сбор на елементите в масив

            // След инициализиране (първоначалното си създаване) масива не може да променя своя размер
            // индекси  -     0, 1, 2, 3, 4
            int[] numbers = { 1, 2, 3, 4, 5 /* елементи на масива */ };

            // Дефинираме (създаваме) нова променлива от тип int която ще пази общата сума
            // на елементите от масива. За тази цел ѝ присвоим (зададем със знака [=]) стойност 0 
            int sum = 0;

            // За да обходим един масив елемент по елемент използваме цикъла for
            // [ключова дума (for)] ([Израз, който ще се изпълни преди започването на цикъла], [Проверка, която показва дали цикъла да продължи или да спре], [Израз, който се изпълнява след всяка итерация(завъртане на цикъла)]) { }
            // Пример:
            // for (int i = 0 /* Първия индекс в масива */; i < numbers.Length /* По този начин достъпваме броя на елементите в масива */; i++ /* След всяка итерация(завъртане) увечличаваме индекса с 1 */)
            for (int i = 0; i < numbers.Length ; i++ )
            {
                // Текущия елемент на масива
                int /* Използваме int, защото масива е от int[] */  currNum = numbers[i] /* По този начин достъпваме елемента на масива намиращ се на индекс i */;

                // С този израз запазваме сумата на масива
                sum = sum /* Общащта сума */ + currNum /* Текущия елемент от масива */;
            }

            Console.WriteLine();
            // След като се изпълни целия цикъл, принтираме общата сумата на елементите от масива
            Console.WriteLine(sum);


            /////////////////////////////////////////////////////////////////////////////////
            // Primer 4 - Част от 1-ва задача за самостоятелна работа
            
            // % -> връща остатъка при целочислено деление
            // 5 % 2 = 1
            // 10 % 3 = 1
            // 1000 % 1000 = 0
            // 1001 % 1000 = 1


            // Декларираме нов масив от int
            // С израза new int[10_000_000] ние присвояваме на масива 10 000 000 елемента
            int[] bigNums = new int[10_000_000];

            // Цикъла обхожда всеки елемент от масива
            for (int i = 0; i < bigNums.Length; i++)
            {
                int currNum = i % 1000; // Вземаме с индекса остатъка от делението на 1000

                // Когато кажем [bigNums[i] =] по този начин присвояваме стойност(число, защощто е int[]) към елемента на масива
                bigNums[i] = currNum + 1; // Добавяме + 1, защото искаме в задачата 1вия елемент да е 1, а не както е индекса 0
            }

            // Декларираме тук нова променлива, която да пази сумата на елементите
            // Декларираме я извън цикъла за да можем после да я достъпим отвън
            // long може да побере повече числа, за това сумата тук е long, а не int. 
            long maxSum = 0;

            // Обхождаме отново масива със вече създадение му стойности
            for (int i = 0; i < bigNums.Length; i++)
            {
                // Текущия елемент от масива на този индекс
                int currNum = bigNums[i];

                // Израза който ползваме за да запазим сумата на масива
                maxSum = maxSum + currNum;
            }

            Console.WriteLine();
            Console.WriteLine(maxSum);
        }
    }
}


// Въпроси върху които да помислиш!

// Какво ще стане, ако променим i = 0 на i = 1?

// Какво ще стане, ако използваме i <= numbers.Length?

// Защо sum е декларирана извън цикъла?

// Какво ще стане, ако премахнем sum = sum + currNum?


// mariqn.dimidov@gmail.com