
using System;

namespace TLArchNUnit_Task3_StudentManagement.Data
{
    // DATA LAYER (Слой за данни)
    //
    // Задача 3: Система за студентски успех
    //
    // Трябва да създадем клас Student,
    // който описва един студент.
    //
    // Всеки студент има:
    // - FacultyNumber -> факултетен номер
    // - FullName      -> три имена
    // - Grade         -> успех от 2.00 до 6.00
    // - Course        -> курс на обучение
    //
    // Например:
    //
    // FacultyNumber: 1001
    // FullName: Иван Иванов
    // Grade: 5.50
    // Course: 2
    //
    // Тези характеристики наричаме
    // свойства (Properties).
    //
    // get -> позволява да прочетем стойността.
    // set -> позволява да променим стойността.

    public class Student
    {
        // int означава цяло число.
        //
        // Например: 1001, 1002, 1003.

        public int FacultyNumber { get; set; }

        // string означава текст.
        //
        // Например: "Иван Иванов".
        //
        // = "" задава първоначално празен текст.

        public string FullName { get; set; } = "";

        // double позволява да съхраняваме
        // дробни числа.
        //
        // Например:
        // 4.50
        // 5.25
        // 6.00
        //
        // Тук ще го използваме за успеха.

        public double Grade { get; set; }

        // Курс на студента.
        //
        // Например:
        // 1 -> първи курс
        // 2 -> втори курс
        // 3 -> трети курс

        public int Course { get; set; }
    }
}
